Revit 2026 API

# GeometryObjectGraphicsStyleId Property

---

The ElementId of the GeometryObject's GraphicsStyle

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GraphicsStyleId { get; }
```
```vb
Public ReadOnly Property GraphicsStyleId As ElementId
	Get
```
```cpp
public:
property ElementId^ GraphicsStyleId {
	ElementId^ get ();
}
```
```fsharp
member GraphicsStyleId : ElementId with get
```

#### Property Value

ElementId

This property provides the id of the GraphicsStyle assigned to the GeometryObject. This can be used to find the category of the object.

#### Reference

GeometryObject Class

Autodesk.Revit.DB Namespace